
#include <iostream>
#include "myhead.h"
#include "myLinkQueue.h"
#include "park.h"

using namespace std;

myLinkQueue<int> a, b;
park x;

void menu();
void code1();
void code2();
void code3();
void code4();
void code5();
void code6();
void code7();
void code8();
void code9();
void code10();
void code101();
void code101tmp();
void code1011();
void code1012();
void code102();
void code103();
void code104();

int main()
{
    while(1)
    {
        system("cls");
        menu();
        if(a.isEmpty())
            cout << " µ±Ç°·ÇÑ­»·ÁŽ¶ÓÎª¿Õ" << endl;
        else
        {
            cout << " µ±Ç°·ÇÑ­»·ÁŽ¶ÓÎª:" << endl;
            cout << a;
        }
        cout << " ---------------------------------------------------- " << endl;
        cout << " ÇëÑ¡ÔñÄãÒª²Ù×÷µÄŽúÂë<1-10>: ";
        int n;
        cin >> n;
        switch(n)
        {
            case 1:
                code1();
                break;
            case 2:
                code2();
                break;
            case 3:
                code3();
                break;
            case 4:
                code4();
                break;
            case 5:
                code5();
                break;
            case 6:
                code6();
                break;
            case 7:
                code7();
                break;
            case 8:
                code8();
                break;
            case 9:
                code9();
                break;
            case 10:
                code10();
                break;
            default:
                cout << " œáÊø" << endl;
                return 0;
        }
        cout << " »¹ŒÌÐøÂð<Y.ŒÌÐø\tN.œáÊø>?";
        char c;
        cin >> c;
        if(c == 'Y' || c == 'y')
            continue;
        else
            break;
    }
    return 0;
}

void code1()
{
    cout << " ------ && œø¶ÓÁÐ(ÔÚ·ÇÑ­»·ÁŽ¶Ó¶ÓÎ²²åÈëœáµã) && ------ " << endl;
    cout << " ÇëÊäÈëÄãÏëÒªÈë¶ÓµÄœáµãµÄÊýŸÝÓò:";
    int e;
    cin >> e;
    a.enQueue(e);
    cout << " ÔÚµ±Ç°·ÇÑ­»·ÁŽ¶ÓµÄ¶ÓÎ²²åÈëœáµã" << e << "ºóÈçÏÂ:" << endl;
    cout << a;
    cout << " ---------------------------------------------------- " << endl;
}

void code2()
{
    cout << " ------- && ³ö¶ÓÁÐ(ÉŸ³ý·ÇÑ­»·ÁŽ¶Ó¶ÓÍ·œáµã) && ------- " << endl;
    if(a.isEmpty())
        cout << " µ±Ç°¶ÓÁÐÎª¿Õ, ÎÞ·šœøÐÐ³ö¶Ó²Ù×÷" << endl;
    else
    {
        int e;
        a.deQueue(e);
        cout << " ÉŸ³ýµ±Ç°·ÇÑ­»·ÁŽ¶Ó¶ÓÍ·µÄœáµã" << e << "ºó,";
        if(a.isEmpty())
            cout << "·ÇÑ­»·ÁŽ¶ÓÎª¿Õ" << endl;
        else
        {
            cout << "·ÇÑ­»·ÁŽ¶ÓÎª:" << endl;
            cout << a;
        }
    }
    cout << " ---------------------------------------------------- " << endl;
}

void code3()
{
    cout << " -------- && ¶Á·ÇÑ­»·ÁŽ¶Ó¶ÓÍ·œáµãµÄÊýŸÝÓò && -------- " << endl;
    if(a.isEmpty())
        cout << " µ±Ç°¶ÓÁÐÎª¿Õ, ÎÞ·šœøÐÐŽËŽÎ²Ù×÷" << endl;
    else
    {
        int e;
        a.getFront(e);
        cout << " ¶ÁÈ¡µ±Ç°·ÇÑ­»·ÁŽ¶Ó¶ÓÍ·œáµãµÄÊýŸÝÓò" << e << "ºó,·ÇÑ­»·ÁŽ¶ÓÎª:" << endl;
        cout << a;
    }
    cout << " ---------------------------------------------------- " << endl;
}

void code4()
{
    cout << " ----------- && ÅÐ¶Ï·ÇÑ­»·ÁŽ¶ÓÊÇ·ñÎª¿Õ && ----------- " << endl;
    if(a.isEmpty())
        cout << " µ±Ç°·ÇÑ­»·ÁŽ¶ÓÎª¿Õ" << endl;
    else
        cout << " µ±Ç°·ÇÑ­»·ÁŽ¶Ó²»Îª¿Õ" << endl;
    cout << " ---------------------------------------------------- " << endl;
}

void code5()
{
    cout << " ----------- && Çó·ÇÑ­»·ÁŽ¶ÓÖÐœáµãµÄžöÊý && --------- " << endl;
    cout << " µ±Ç°·ÇÑ­»·ÁŽ¶ÓÖÐœáµãµÄžöÊýÎª: " << a.getLength() << endl;
    cout << " ---------------------------------------------------- " << endl;
}

void code6()
{
    cout << " --- &&  °ÑÒ»žö·ÇÑ­»·ÁŽ¶Óž³ÖµžøÁíÒ»žö·ÇÑ­»·ÁŽ¶Ó && -- " << endl;
    cout << " ÁíÒ»žö·ÇÑ­»·ÁŽ¶Óž³Öµžøµ±Ç°·ÇÑ­»·ÁŽ¶ÓÎª: " << endl;
    b.getByRand(0);
    a = b;
    cout << a;
    cout << " ---------------------------------------------------- " << endl;
}

void code7()
{
    cout << " ------------ && °Ñ·ÇÑ­»·ÁŽ¶ÓÖÃ¿Õ && ---------------- " << endl;
    a.clear();
    cout << " µ±Ç°·ÇÑ­»·ÁŽ¶ÓÖÃ¿Õºó, œáµãµÄžöÊýÎª: " << a.getLength() << endl;
    cout << " ---------------------------------------------------- " << endl;
}

void code8()
{
    cout << " ------------- && Ëæ»úÉú³É·ÇÑ­»·ÁŽ¶Ó && ------------- " << endl;
    cout << " ÒÀŽÎÔÚ¶ÓÎ²²åÈë:\n";
    a.getByRand(1);
    cout << " Ëæ»úÉú³É·ÇÑ­»·ÁŽ¶ÓÎª:\n";
    cout << a;
    cout << " ---------------------------------------------------- " << endl;
}

void code9()
{
    cout << " -- && ÓÃÒÑÓÐ·ÇÑ­»·ÁŽ¶Ó³õÊŒ»¯ÁíÒ»žöÐÂ·ÇÑ­»·ÁŽ¶Ó && -- " << endl;
    cout << " µ±Ç°·ÇÑ­»·ÁŽ¶Ó³õÊŒ»¯ÁíÒ»žö·ÇÑ­»·ÁŽ¶ÓÎª:" << endl;
    b = a;
    cout << b;
    cout << " ---------------------------------------------------- " << endl;
}

void code10()
{
    while(1)
    {
        system("cls");
        cout << " --------- && Í£³µ³¡¹ÜÀí(Õ»ºÍ¶ÓÁÐµÄÓŠÓÃ) && --------- " << endl;
        cout << " 10.1. Ä£Äâ³µÁŸµ÷¶È\n"
             << " 10.2. ÉèÖÃÍ£³µ³¡¿ÉÍ£³µÁŸµÄ×îŽóÊýÄ¿\n"
             << " 10.3. ÉèÖÃµ¥Î»Ê±ŒäµÄÊÕ·ÑÖµ\n"
             << " 10.4. Ëæ»úÉú³ÉÍ£³µµÄ³µÁŸ\n"
             << " ÆäËû. œáÊø " << endl;
        cout << " ---------------------------------------------------- " << endl;
        cout << x;
        cout << " ---------------------------------------------------- " << endl;
        cout << " ÇëÑ¡ÔñÄãÒª²Ù×÷µÄŽúÂë<1-4>: ";
        int n;
        cin >> n;
        switch(n)
        {
            case 1:
                code101();
                break;
            case 2:
                code102();
                break;
            case 3:
                code103();
                break;
            case 4:
                code104();
                break;
            default:
                cout << " œáÊø" << endl;
                return ;
        }
        cout << " »¹ŒÌÐøÂð<Y.ŒÌÐø\tN.œáÊø>?";
        char c;
        cin >> c;
        if(c == 'Y' || c == 'y')
            continue;
        else
            break;
        cout << " ---------------------------------------------------- " << endl;
    }
}

void code101()
{
    while(1)
    {
        system("cls");
        cout << " ---------------- && Ä£Äâ³µÁŸµ÷¶È && ---------------- " << endl;
        cout << " ÇëÑ¡Ôñµ÷¶È·œÊœ<1.Àë¿ª\t2.œøÈë\t0.œáÊø>: ";
        int way;
        while(cin >> way)
        {
            if(way == 1 || way == 0 || way == 2)
                break;
            else
            {
                cout << " ÄúµÄÊäÈë·Ç·š" << endl;
                cout << " ÇëÑ¡Ôñµ÷¶È·œÊœ<1.Àë¿ª\t2.œøÈë\t0.œáÊø>: ";
            }
        }
        switch(way)
        {
            case 1:
                code1011();
                break;
            case 2:
                code1012();
                break;
            default:
                cout << " œáÊø" << endl;
                return ;
        }
        if(way)
            code101tmp();
        cout << " ---------------------------------------------------- " << endl;
        cout << " »¹ŒÌÐøÄ£ÄâÍ£³µ³¡µ÷¶ÈÂð<Y.ŒÌÐø\tN.œáÊø>? ";
        char c;
        cin >> c;
        if(c == 'y' || c == 'Y')
            continue;
        else
            break;
    }
}

void code1011()
{
    int sn = x.inCarNum();
    if(sn > 0)
    {
        cout << " ÇëÊäÈëÄÄžöÎ»ÖÃÉÏµÄ³µÁŸ×Œ±žÀë¿ª";
        int n;
        while(cin >> n)
        {
            if(n >= 0 && n <= sn)
                break;
            else
                cout << " ÄúµÄÊäÈë·Ç·š, ÇëÊäÈë<0-" << sn << "> ";
        }
        x.carOut(n);
    }
    else
        cout << " µ±Ç°Í£³µ³¡ÖÐÃ»ÓÐ³µÁŸ" << endl;
}

void code1012()
{
    cout << " ÇëÊäÈëÍ£³µ³µÁŸµÄ³µÅÆºÅ: ";
    string name;
    cin >> name;
    x.carIn(name);
}

void code101tmp()
{
    cout << " ŽËŽÎµ÷¶Èºó, Í£³µ³¡ÄÚÍâÐÅÏ¢ÈçÏÂ: " << endl;
    cout << x;
}

void code102()
{
    cout << " -------- && ÉèÖÃÍ£³µ³¡¿ÉÍ£³µ³¡µÄ×îŽóÊýÄ¿ && -------- " << endl;
    cout << " ÇëÊäÈë×î¶à¿ÉÈÝÄÉµÄ³µÁŸÊý: ";
    int n;
    while(cin >> n)
    {
        if(n >= 0)
            break;
        else
            cout << " ÇëÊäÈë·ÇžºÕûÊý: ";
    }
    x.setSize(n);
    cout << " ---------------------------------------------------- " << endl;
}

void code103()
{
    cout << " ------------ && ÉèÖÃµ¥Î»Ê±ŒäµÄÊÕ·ÑÖµ && ------------ " << endl;
    cout << " ÇëÊäÈëÍ£³µ³¡µ¥Î»Ê±ŒäµÄÊÕ·ÑÂÊ: ";
    int fee;
    while(cin >> fee)
    {
        if(fee >= 0)
            break;
        else
            cout << " ÇëÊäÈë·ÇžºÕûÊý: ";
    }
    x.setFee(fee);
    cout << " ÒÑŸ­ÉèÖÃÍ£³µ³¡µ¥Î»Ê±ŒäµÄÊÕ·ÑÂÊÎª: " << x.outputFee() << endl;
    cout << " ---------------------------------------------------- " << endl;
}

void code104()
{
    cout << " ------------ && Ëæ»úÉú³ÉÍ£³µ³¡µÄ³µÁŸ && ------------ " << endl;
    x.getByRand(1);
    cout << " ---------------------------------------------------- " << endl;
}

void menu()
{
    cout << " ------------ && ²âÊÔ·ÇÑ­»·ÁŽ¶ÓµÄ²Ù×÷ && ------------ " << endl;
    cout << "    1. œø¶ÓÁÐ(ÔÚ·ÇÑ­»·ÁŽ¶ÓÁÐ¶ÓÎ²²åÈëœáµã)\n"
         << "    2. ³ö¶ÓÁÐ(ÉŸ³ý·ÇÑ­»·ÁŽ¶ÓÁÐ¶ÓÍ·œáµã)\n"
         << "    3. ¶Á·ÇÑ­»·ÁŽ¶Ó¶ÓÍ·œáµãµÄÊýŸÝÓò\n"
         << "    4. ÅÐ¶Ï·ÇÑ­»·ÁŽ¶ÓÊÇ·ñÎª¿Õ\n"
         << "    5. Çó·ÇÑ­»·ÁŽ¶ÓÖÐÔªËØµÄžöÊý\n"
         << "    6. °ÑÒ»žö·ÇÑ­»·ÁŽ¶Óž³ÖµžøÁíÒ»žö·ÇÑ­»·ÁŽ¶Ó\n"
         << "    7. °Ñ·ÇÑ­»·ÁŽ¶ÓÖÃ¿Õ\n"
         << "    8. Ëæ»úÉú³É·ÇÑ­»·ÁŽ¶Ó\n"
         << "    9. ÓÃÒÑÓÐµÄ·ÇÑ­»·ÁŽ¶Ó³õÊŒ»¯ÁíÒ»žöÐÂ·ÇÑ­»·ÁŽ¶Ó\n"
         << "   10. Í£³µ³¡¹ÜÀí(Õ»ºÍ¶ÓÁÐµÄÓŠÓÃ)\n"
         << " ÆäËû. œáÊø " << endl;
    cout << " ---------------------------------------------------- " << endl;
}
